Инвентаризация_IT/src/Documents/РабочиеМеста/РабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РабочиеМеста</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПК</name>
    <attributes>
      <name>ИмяПК</name>
      <type>
        <types>CatalogRef.Компьютеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОперационнаяСистема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процессор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОЗУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОЗУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MACАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Мониторы</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.Мониторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодключения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МодельКартриджа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТерминалыСбораДанных</name>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MACАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Видеорегистраторы</name>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IPАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКаналов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Камеры</name>
    <attributes>
      <name>IPАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Логин</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Инвентаризация_IT/src/Catalogs/Мониторы/Мониторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мониторы</name>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Инвентаризация_IT/src/Catalogs/Компьютеры/Компьютеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Компьютеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процессор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОЗУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОЗУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>DocumentRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЖесткиеДиски</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПамяти</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Устройства</name>
    <attributes>
      <name>Реквизит1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Инвентаризация_IT/src/Documents/РабочиеМеста/Forms/ФормаДокумента/Module.bsl
///////////////////////////////////////
 //Заполнение табличной части Мониторы//
///////////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиМонитор(СерийныйНомер)
  Возврат Справочники.Мониторы.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеМонитора(Монитор)
	
	ДанныеМонитора = Новый Структура;
	
	ДанныеМонитора.Вставить("Производитель", Монитор.Производитель);
  	ДанныеМонитора.Вставить("Модель", Монитор.Модель);
  	ДанныеМонитора.Вставить("Размер", Монитор.Размер);
	
	Возврат ДанныеМонитора;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура МониторыСерийныйНомерПриИзменении(Элемент)
 	Монитор = Элементы.Мониторы.ТекущиеДанные;   
	
	ОбъектМонитора = НайтиМонитор(Монитор.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектМонитора <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеМонитора = ПолучитьДанныеМонитора(ОбъектМонитора);
    
    // Заполняем реквизиты табличной части
    Монитор.Производитель = ДанныеМонитора.Производитель;
    Монитор.Модель = ДанныеМонитора.Модель;
    Монитор.Размер = ДанныеМонитора.Размер;
    
  КонецЕсли;
 	
 КонецПроцедуры


  /////////////////////////////////
 //Заполнение табличной части ПК//
/////////////////////////////////

 //@skip-check module-structure-method-in-regions
 &НаСервере
Функция НайтиКомпьютер(ИмяПК)
  Возврат Справочники.Компьютеры.НайтиПоНаименованию(ИмяПК);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеКомпьютера(Компьютер)
	
	ДанныеКомпьютера = Новый Структура;
	
	ДанныеКомпьютера.Вставить("ОперационнаяСистема", Компьютер.ОперационнаяСистема);
  	ДанныеКомпьютера.Вставить("Процессор", Компьютер.Процессор);
  	ДанныеКомпьютера.Вставить("ТипОЗУ", Компьютер.ТипОЗУ);
	ДанныеКомпьютера.Вставить("КоличествоОЗУ", Компьютер.КоличествоОЗУ);
	ДанныеКомпьютера.Вставить("MACАдрес", Компьютер.MACАдрес);
	
	Возврат ДанныеКомпьютера;
	
КонецФункции


//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПКИмяПКПриИзменении(Элемент)
	Компьютер = Элементы.ПК.ТекущиеДанные;   
	
	ОбъектКомпьютера = НайтиКомпьютер(Компьютер.ИмяПК); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектКомпьютера <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеКомпьютера = ПолучитьДанныеКомпьютера(ОбъектКомпьютера);
    
    // Заполняем реквизиты табличной части
    Компьютер.ОперационнаяСистема = ДанныеКомпьютера.ОперационнаяСистема;
    Компьютер.Процессор = ДанныеКомпьютера.Процессор;
    Компьютер.ТипОЗУ = ДанныеКомпьютера.ТипОЗУ;
    Компьютер.КоличествоОЗУ = ДанныеКомпьютера.КоличествоОЗУ;
    Компьютер.MACАдрес = ДанныеКомпьютера.MACАдрес;
    
  КонецЕсли;

КонецПроцедуры
